# (if/elif/else)

# Заданы размеры envelop_x, envelop_y - размеры конверта и paper_x, paper_y листа бумаги
#
# Определить, поместится ли бумага в конверте (стороны листа параллельны сторонам конверта)
#
# Результат проверки вывести на консоль (ДА/НЕТ)
# Использовать только операторы if/elif/else, можно вложенные

envelop_x, envelop_y = 10, 7
list_cords = [[9, 8], #x, y
            [6, 8],
            [8, 6],
            [3, 4],
            [11, 9],
            [9, 11]
]

for i in list_cords:
    if i[0] < envelop_x and i[1] < envelop_y:
        print('Yes')
    else:
        print('No')


# Усложненное задание, решать по желанию.
# Заданы размеры hole_x, hole_y прямоугольного отверстия и размеры brick_х, brick_у, brick_z кирпича (все размеры
# могут быть в диапазоне от 1 до 1000)
#
# Определить, пройдет ли кирпич через отверстие (грани кирпича параллельны сторонам отверстия)

hole_x, hole_y = 8, 9
brick_list = [
            [11, 10, 2], #x,y,z
            [11, 2, 10],
            [10, 11, 2],
            [10, 2, 11],
            [2, 10, 11],
            [2, 11, 10],
            [3, 5, 6],
            [3, 6, 5],
            [6, 3, 5],
            [6, 5, 3],
            [5, 6, 3],
            [5, 3, 6],
]
for i in brick_list:
    if hole_y < i[2] and hole_x < i[0]:
        print('Yes')
    elif hole_y < i[2] and hole_x < i[1]:
        print('Yes')
    elif hole_y < i[1] and hole_x < i[0]:
        print('Yes')
    else:
        print('No')



